## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           RESOURCE                            |
|--------|---------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.superset_docs_errors`       |
|        | `aws_cloudwatch_metric_alarm.superset_docs_errors`            |
|        | `aws_cloudwatch_metric_alarm.superset_docs_health_check`      |
|        | `aws_cloudwatch_metric_alarm.superset_docs_invocation_errors` |
|        | `aws_cloudwatch_query_definition.superset_ecs_errors`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.superset_docs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "superset_docs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/cds-superset-docs"
      + name           = "error-superset-docs"
      + pattern        = "ERROR? Error? error?"

      + metric_transformation {
          + default_value = "0"
          + name          = "error-superset-docs"
          + namespace     = "superset-docs"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.superset_docs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` errors logged over 1 minute."
      + alarm_name                            = "errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "error-superset-docs"
      + namespace                             = "superset-docs"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_health_check will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_health_check" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` heath check has failed in a 2 minute period."
      + alarm_name                            = "health-check-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "HealthCheckId" = "5d446801-7f3d-4680-bd2e-273be959d5b3"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HealthCheckStatus"
      + namespace                             = "AWS/Route53"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Minimum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.superset_docs_invocation_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "superset_docs_invocation_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-warning",
        ]
      + alarm_description                     = "`superset-docs` invocation errors logged over 1 minute."
      + alarm_name                            = "invokcation-errors-superset-docs"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:257394494478:cloudwatch-alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "cds-superset-docs-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.superset_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "superset_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/cds-superset-docs",
        ]
      + name                = "Superset Docs - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /(?i)error/
            | sort @timestamp desc
            | limit 100
        EOT
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.superset_docs_errors"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
